In [1]:
import numpy as np
import pandas as pd

In [22]:
stdData= {
    "Math" : [49,50,66,74,83],
    "Physics" : [66,74,29,68,95],
    "Computer": [55,98,74,69,86]
}

Indexnames = ["Murtaza","Ali","Husain","Hatim","Mustafa"]
stdDataFrame = pd.DataFrame(stdData, index=Indexnames)
stdDataFrame

         Math  Physics  Computer
Murtaza    49       66        55
Ali        50       74        98
Husain     66       29        74
Hatim      74       68        69
Mustafa    83       95        86

In [23]:
stdDataFrame["Total_Marks"] = stdDataFrame["Math"]+stdDataFrame["Physics"]+stdDataFrame["Computer"] 
stdDataFrame

         Math  Physics  Computer  Total_Marks
Murtaza    49       66        55          170
Ali        50       74        98          222
Husain     66       29        74          169
Hatim      74       68        69          211
Mustafa    83       95        86          264

In [24]:
stdDataFrame["Percentage"] = stdDataFrame["Total_Marks"]/300 * 100
stdDataFrame["Percentage"] = [str(i)+"%" for i in (stdDataFrame["Percentage"])]
stdDataFrame

         Math  Physics  Computer  Total_Marks           Percentage
Murtaza    49       66        55          170  56.666666666666664%
Ali        50       74        98          222                74.0%
Husain     66       29        74          169  56.333333333333336%
Hatim      74       68        69          211   70.33333333333334%
Mustafa    83       95        86          264                88.0%

In [27]:
stdDataFrame["RemarksBasedOnTotalMarks"] = ["pass" if marks>200 else "fail" for marks in stdDataFrame["Total_Marks"]]
stdDataFrame["RemarksBasedOnEachSubject"] = ["pass" if m>33 and p>33 and c>33 else "fail" for m,p,c in zip(stdDataFrame["Math"],stdDataFrame["Physics"],stdDataFrame["Computer"])]
stdDataFrame

,Math,Physics,Computer,Total_Marks,Percentage,RemarksBasedOnTotalMarks,RemarksBasedOnEachSubject
Murtaza,49,66,55,170,56.666666666666664%,fail,pass
Ali,50,74,98,222,74.0%,pass,pass
Husain,66,29,74,169,56.333333333333336%,fail,fail
Hatim,74,68,69,211,70.33333333333334%,pass,pass
Mustafa,83,95,86,264,88.0%,pass,pass

In [41]:
stdDataFrame.values[0]

array([49, 66, 55, 170, '56.666666666666664%', 'fail', 'pass'],
      dtype=object)

In [43]:
obj3 = pd.Series(['blue','green','yellow'], index=[0,5,15])
obj3

0       blue
5      green
15    yellow
dtype: object

In [44]:
obj3.reindex(range(16), method="ffill")

0       blue
1       blue
2       blue
3       blue
4       blue
5      green
6      green
7      green
8      green
9      green
10     green
11     green
12     green
13     green
14     green
15    yellow
dtype: object

In [45]:
obj3.reindex(range(16), method="bfill")

0       blue
1      green
2      green
3      green
4      green
5      green
6     yellow
7     yellow
8     yellow
9     yellow
10    yellow
11    yellow
12    yellow
13    yellow
14    yellow
15    yellow
dtype: object

In [53]:
frame= pd.DataFrame(np.arange(50).reshape(10,5), index=[i+1 for i in range(10)], columns=["c1","c2","c3","c4","c5"])
frame

    c1  c2  c3  c4  c5
1    0   1   2   3   4
2    5   6   7   8   9
3   10  11  12  13  14
4   15  16  17  18  19
5   20  21  22  23  24
6   25  26  27  28  29
7   30  31  32  33  34
8   35  36  37  38  39
9   40  41  42  43  44
10  45  46  47  48  49

In [61]:
frame.drop(10)
frame.fillna(5, inplace=True)   #replace NAN values with given number

In [62]:
frame

    c1  c2  c3  c4  c5
1    0   1   2   3   4
2    5   6   7   8   9
3   10  11  12  13  14
4   15  16  17  18  19
5   20  21  22  23  24
6   25  26  27  28  29
7   30  31  32  33  34
8   35  36  37  38  39
9   40  41  42  43  44
10  45  46  47  48  49

In [89]:
stdDatas= {
    "Math" : [49,50,66,74,83],
    "Physics" : [66,74,29,68,95],
    "Computer": [55,98,74,69,86]
}

Indexnames = ["Murtaza","Ali","Husain","Hatim","Mustafa"]
stdDataFrame = pd.DataFrame(stdData, index=Indexnames)
stdDataFrame

         Math  Physics  Computer
Murtaza    49       66        55
Ali        50       74        98
Husain     66       29        74
Hatim      74       68        69
Mustafa    83       95        86

In [88]:
np.where(stdDataFrame < 33 , "Fail","Pass") 
.l

array([['Pass', 'Pass', 'Pass'],
       ['Pass', 'Pass', 'Pass'],
       ['Pass', 'Fail', 'Pass'],
       ['Pass', 'Pass', 'Pass'],
       ['Pass', 'Pass', 'Pass']], dtype='<U4')

In [99]:
f = lambda x: [x.min(), x.max()]
stdDataFrame.apply(f)  # apply function to each columns

#stdDataFrame[:].apply(f)  # apply function to specified columns
#applymap :  run function/code on each coloumn's value
#apply :  run function/code on each coloumn
#map: run function/codeunction/code on provided column

Math        [49, 83]
Physics     [29, 95]
Computer    [55, 98]
dtype: object

In [120]:
f = lambda x: [x.min(), x.max()]
stdDataFrame.apply(f)

pandas.core.series.Series

In [125]:
f = lambda x: ["pass" if i>33 else "fail" for i in x]
stdDataFrame.apply(f)

         Math Physics Computer
Murtaza  pass    pass     pass
Ali      pass    pass     pass
Husain   pass    fail     pass
Hatim    pass    pass     pass
Mustafa  pass    pass     pass

In [122]:
"hello"

'hello'

SyntaxError: invalid syntax (<ipython-input-123-810ef1e61a82>, line 1)